tests/oracles/oracle-poja-sqlite/artillery-perf-v9.0.3.txt
--------------------------------
Summary report @ 12:57:59(+0100)
--------------------------------

errors.ETIMEDOUT: .............................................................. 20
http.codes.200: ................................................................ 280
http.request_rate: ............................................................. 5/sec
http.requests: ................................................................. 300
http.response_time:
  min: ......................................................................... 50
  max: ......................................................................... 6700
  median: ...................................................................... 83.9
  p95: ......................................................................... 6187.2
  p99: ......................................................................... 6569.8
http.responses: ................................................................ 280
vusers.completed: .............................................................. 280
vusers.created: ................................................................ 300
vusers.created_by_name.0: ...................................................... 300
vusers.failed: ................................................................. 20
vusers.session_length:
  min: ......................................................................... 126.5
  max: ......................................................................... 8809
  median: ...................................................................... 237.5
  p95: ......................................................................... 7260.8
  p99: ......................................................................... 8352

--------------------------------
Summary report @ 13:11:17(+0100)
--------------------------------

http.codes.200: ................................................................ 300
http.request_rate: ............................................................. 5/sec
http.requests: ................................................................. 300
http.response_time:
  min: ......................................................................... 44
  max: ......................................................................... 6990
  median: ...................................................................... 66
  p95: ......................................................................... 5944.6
  p99: ......................................................................... 6187.2
http.responses: ................................................................ 300
vusers.completed: .............................................................. 300
vusers.created: ................................................................ 300
vusers.created_by_name.0: ...................................................... 300
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 115.6
  max: ......................................................................... 7084.6
  median: ...................................................................... 159.2
  p95: ......................................................................... 5944.6
  p99: ......................................................................... 6312.2